In [1]:
import pandas as pd
df = pd.read_csv("D:/ISB/datasets/data_house/data_house.csv",index_col=0)

In [2]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [48]:
df.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [32]:
# len(df)

rows, cols = df.shape
print("Rows:", rows)
print("Columns:", cols)

Rows: 21613
Columns: 21

In [13]:
df["price"]

0        221900.0
1        538000.0
2        180000.0
3        604000.0
4        510000.0
           ...
21608    360000.0
21609    400000.0
21610    402101.0
21611    400000.0
21612    325000.0
Name: price, Length: 21613, dtype: float64

In [5]:
df["sqft_living"][1:10]

1    2570
2     770
3    1960
4    1680
5    5420
6    1715
7    1060
8    1780
9    1890
Name: sqft_living, dtype: int64

In [24]:
df.loc[1:3,["price","sqft_living"]]

      price  sqft_living
1  538000.0         2570
2  180000.0          770
3  604000.0         1960

In [26]:
df.iloc[0:3,2:10]

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view
1,538000.0,3,2.25,2570,7242,2.0,0,0
2,180000.0,2,1.00,770,10000,1.0,0,0

In [27]:
df.iloc[:5,:]

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [28]:
max_value = df["price"].max()
print(max_value)

7700000.0

In [29]:
df.iloc[-5:]

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
21608,263000018,20140521T000000,360000.0,3,2.50,1530,1131,3.0,0,0,...,8,1530,0,2009,0,98103,47.6993,-122.346,1530,1509
21609,6600060120,20150223T000000,400000.0,4,2.50,2310,5813,2.0,0,0,...,8,2310,0,2014,0,98146,47.5107,-122.362,1830,7200
21610,1523300141,20140623T000000,402101.0,2,0.75,1020,1350,2.0,0,0,...,7,1020,0,2009,0,98144,47.5944,-122.299,1020,2007
21611,291310100,20150116T000000,400000.0,3,2.50,1600,2388,2.0,0,0,...,8,1600,0,2004,0,98027,47.5345,-122.069,1410,1287
21612,1523300157,20141015T000000,325000.0,2,0.75,1020,1076,2.0,0,0,...,7,1020,0,2008,0,98144,47.5941,-122.299,1020,1357

In [44]:
df.loc[df["bedrooms"] == 3, ["bedrooms", "price"]].head()

   bedrooms     price
0         3  221900.0
1         3  538000.0
4         3  510000.0
6         3  257500.0
7         3  291850.0

In [47]:
df[df["bedrooms"] == 4].iloc[:, 3:8].head(5)

    bedrooms  bathrooms  sqft_living  sqft_lot  floors
3          4       3.00         1960      5000     1.0
5          4       4.50         5420    101930     1.0
15         4       3.00         2950      5000     2.0
17         4       1.00         1600      4300     1.5
20         4       1.75         1620      4980     1.0

In [51]:
max_value = df["yr_built"].max()
print(max_value)

2015

In [58]:
df.loc[(df["price"] > 2500000) & (df["yr_built"] >= 2010),["id","sqft_living","bedrooms"]]

               id  sqft_living  bedrooms
5880   2525049148         5450         5
7432   5316100780         3280         4
20154  1176001310         4340         5
20325   518500480         4410         3
20535  1370800515         4470         4
21040  6447300365         5190         5
21530  8964800330         5090         4

In [63]:
df.loc[((df["price"] > 2500000) & (df["yr_built"] >= 2010)) | (((df["price"]<300000)&(df["bedrooms"]==4))|(df["bathrooms"]==3)),["id","sqft_living","bedrooms","bathrooms"]]

               id  sqft_living  bedrooms  bathrooms
3      2487200875         1960         4        3.0
15     9297300055         2950         4        3.0
38     7895500070         1220         4        1.0
56     9478500640         2250         4        2.5
59     8079040320         1850         4        3.0
...           ...          ...       ...        ...
21566  3528900770         1670         4        3.0
21574  1931300090         1680         3        3.0
21580  7853420110         2780         3        3.0
21581  7853420110         2780         3        3.0
21599  7202300110         3990         4        3.0

[1510 rows x 4 columns]

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 21613 entries, 0 to 21612
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21613 non-null  int64
 1   date           21613 non-null  object
 2   price          21613 non-null  float64
 3   bedrooms       21613 non-null  int64
 4   bathrooms      21613 non-null  float64
 5   sqft_living    21613 non-null  int64
 6   sqft_lot       21613 non-null  int64
 7   floors         21613 non-null  float64
 8   waterfront     21613 non-null  int64
 9   view           21613 non-null  int64
 10  condition      21613 non-null  int64
 11  grade          21613 non-null  int64
 12  sqft_above     21613 non-null  int64
 13  sqft_basement  21613 non-null  int64
 14  yr_built       21613 non-null  int64
 15  yr_renovated   21613 non-null  int64
 16  zipcode        21613 non-null  int64
 17  lat            21613 non-null  float64
 18  long           21613 non-null  float64
 19  sqft_living15  21613 non-null  int64
 20  sqft_lot15     21613 non-null  int64
dtypes: float64(5), int64(15), object(1)
memory usage: 4.1+ MB